src/Catalogs/ШаблоныЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ирАлгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фПоРабочимМестам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураВыполяетсяНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативноеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьЗаранееЗа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФильтрИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрРМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ирАлгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флагРезультат</Name>
					<Comment>0 не выполнялась, 1 выполнилась без ошибок, -1 были ошибки при выполнении</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураВыполяетсяНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативноеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныЗадач/Forms/СозданиеЗадач/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьЗадачиНаСервере(пШаблон)
	Для Каждого элИБ Из СписокИБ Цикл
		ИБ = элИБ.Значение;
		СоздатьЗадачиНаСервереПоИБ(пШаблон, , , ИБ);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектПодходит(Объект, Фильтр)
	//:Фильтр = Справочники.ШаблоныЗадач.СоздатьЭлемент().ФильтрИБ;
	Для Каждого СтрокаФильтра Из Фильтр Цикл
		Если СтрокаФильтра.Использование Тогда
			ЗначениеАтрибута = Объект[СтрокаФильтра.Атрибут];
			фУсловиеВыполнено = Ложь;
			Если СтрокаФильтра.ВидСравнения = "Равно" Тогда
				фУсловиеВыполнено = ЗначениеАтрибута = СтрокаФильтра.Значение;
			ИначеЕсли СтрокаФильтра.ВидСравнения = "Содержит" Тогда
				фУсловиеВыполнено = СтрНайти(ЗначениеАтрибута, СтрокаФильтра.Значение);
			ИначеЕсли СтрокаФильтра.ВидСравнения = "Не содержит" Тогда
				фУсловиеВыполнено = СтрНайти(ЗначениеАтрибута, СтрокаФильтра.Значение) = 0;
			КонецЕсли;
			Если Не фУсловиеВыполнено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Процедура СоздатьЗадачиНаСервереПоИБ(пШаблон, Родитель = Неопределено, РабочееМесто = Неопределено, ИБ)
	//:пШаблон = Шаблон;
	Если Не ОбъектПодходит(ИБ, пШаблон.ФильтрИБ) Тогда
		Возврат;
	КонецЕсли;
	тРабочееМесто = РабочееМесто;
	Если Не ЗначениеЗаполнено(тРабочееМесто) Тогда
		тРабочееМесто = ?(ЗначениеЗаполнено(Родитель), Родитель.РабочееМесто, Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тРабочееМесто) Тогда
		Если Не ОбъектПодходит(тРабочееМесто, пШаблон.ФильтрРМ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если пШаблон.фПоРабочимМестам И Не ЗначениеЗаполнено(РабочееМесто) Тогда
		РабочиеМеста = РабочиеМеста(ИБ);
		Для Каждого РабочееМесто Из РабочиеМеста Цикл
			Если Не ОбъектПодходит(РабочееМесто, пШаблон.ФильтрРМ) Тогда
				Продолжить;
			КонецЕсли;
			СоздатьЗадачиНаСервереПоИБ(пШаблон, Родитель, РабочееМесто, ИБ);
		КонецЦикла;
		РабочееМесто = Неопределено;
	Иначе
		обЗадача = Справочники.Задачи.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(обЗадача, пШаблон,,"Код,Владелец");
		Если Родитель <> Неопределено Тогда
			обЗадача.Родитель = Родитель;
		КонецЕсли;
		обЗадача.ИнформационнаяБаза = ИБ;                                     
		обЗадача.РабочееМесто = РабочееМесто;
		Если ЗначениеЗаполнено(Родитель) Тогда
			обЗадача.ПланируемаяДатаВыполнения = Родитель.ПланируемаяДатаВыполнения;
		Иначе
			обЗадача.ПланируемаяДатаВыполнения = ПланируемаяДатаВыполнения;
		КонецЕсли;
		
		Если пШаблон.ВыполнятьЗаранееЗа Тогда
			обЗадача.ПланируемаяДатаВыполнения = ДобавитьДень(ПланируемаяДатаВыполнения,-пШаблон.ВыполнятьЗаранееЗа);
		Иначе
			обЗадача.ПланируемаяДатаВыполнения = ПланируемаяДатаВыполнения;
		КонецЕсли;
		
		Если Родитель = Неопределено Тогда
			обЗадача.Наименование = ИБ.Наименование + " - " + обЗадача.Наименование;
		ИначеЕсли ЗначениеЗаполнено(РабочееМесто) Тогда
			обЗадача.Наименование = "" + Сеть.ИмяХостаРМ(РабочееМесто) + " - " + обЗадача.Наименование;
		КонецЕсли;
		обЗадача.КодШаблона = пШаблон.Код;
		обЗадача.Записать();
		Задача = обЗадача.Ссылка;
		тРабочееМесто = РабочееМесто;
		РабочееМесто = Неопределено;
		Если Не ЗначениеЗаполнено(тРабочееМесто) Тогда
			тРабочееМесто = ?(ЗначениеЗаполнено(Родитель), Родитель.РабочееМесто, Неопределено);
		КонецЕсли;		
		Выб = Справочники.ШаблоныЗадач.Выбрать(пШаблон);
		Пока Выб.Следующий() Цикл
			Если Выб.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			СоздатьЗадачиНаСервереПоИБ(Выб.Ссылка, Задача, тРабочееМесто, ИБ);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РабочиеМеста(ИБ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РабочиеМеста.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	НЕ РабочиеМеста.ПометкаУдаления
	|	И РабочиеМеста.ИнформационнаяБаза = &ИнформационнаяБаза
	|	И НЕ РабочиеМеста.ЭтоГруппа");
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИБ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура СоздатьЗадачи(Команда)
	СоздатьЗадачиНаСервере(Шаблон);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Шаблон = Параметры.Шаблон;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Шаблон = Параметры.Шаблон;

КонецПроцедуры
